updated diagrams in readme
